darshme7/embedded_systems_online_diploma/Unit7_MCUEssentialPeripherals/Assignment3/stm32f103c8_gpio_driver.c
/*
 * stm32f103c8_gpio_driver.c
 *
 *  Created on: May 31, 2021
 *      Author: mosta
 */

#include "stm32f103c8_gpio_driver.h"




/**================================================================
 * @Fn			-MCAL_GPIO_deinit.
 * @brief	    -initialize the GPIOx PINy according to Config instance cfg.
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @param [in] 	-cfg: pointer to GPIO_config that contains pin/port confiquration.
 * @retval 		-none
 * Note			-none
 */

void MCAL_GPIO_init(GPIO_typedef * GPIOx,GPIO_config * cfg){
	switch(cfg->GPIO_PinNumber){
	case GPIO_PIN0:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE0 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE0 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE0 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE0 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF0 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF0 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF0 = 0b10;
			GPIOx->BSRR.bits.BS0 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF0 = 0b10;
			GPIOx->BRR.bits.BR0  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF0 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF0 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF0 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF0 = 0b11;
			break;
		}
		break;

	case GPIO_PIN1:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE1 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE1 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE1 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE1 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF1 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF1 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF1 = 0b10;
			GPIOx->BSRR.bits.BS1 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF1 = 0b10;
			GPIOx->BRR.bits.BR1  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF1 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF1 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF1 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF1 = 0b11;
			break;
		}
		break;
	case GPIO_PIN2:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE2 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE2 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE2 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE2 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF2 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF2 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF2 = 0b10;
			GPIOx->BSRR.bits.BS2 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF2 = 0b10;
			GPIOx->BRR.bits.BR2  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF2 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF2 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF2 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF2 = 0b11;
			break;
		}
		break;

	case GPIO_PIN3:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE3 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE3 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE3 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE3 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF3 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF3 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF3 = 0b10;
			GPIOx->BSRR.bits.BS3 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF3 = 0b10;
			GPIOx->BRR.bits.BR3  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF3 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF3 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF3 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF3 = 0b11;
			break;
		}
		break;

	case GPIO_PIN4:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE4 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE4 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE4 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE4 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF4 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF4 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF4 = 0b10;
			GPIOx->BSRR.bits.BS4 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF4 = 0b10;
			GPIOx->BRR.bits.BR4  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF4 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF4 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF4 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF4 = 0b11;
			break;
		}
		break;

	case GPIO_PIN5:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE5 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE5 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE5 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE5 = 0b00;

