darshme7/embedded_systems_online_diploma/Unit7_MCUEssentialPeripherals/Assignment3/stm32f103c8_gpio_driver.c
		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF5 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF5 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF5 = 0b10;
			GPIOx->BSRR.bits.BS5 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF5 = 0b10;
			GPIOx->BRR.bits.BR5  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF5 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF5 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF5 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF5 = 0b11;
			break;
		}
		break;

	case GPIO_PIN6:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE6 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE6 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE6 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE6 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF6 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF6 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF6 = 0b10;
			GPIOx->BSRR.bits.BS6 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF6 = 0b10;
			GPIOx->BRR.bits.BR6  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF6 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF6 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF6 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF6 = 0b11;
			break;
		}
		break;

	case GPIO_PIN7:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRL.bits.MODE7 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRL.bits.MODE7 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRL.bits.MODE7 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRL.bits.MODE7 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.bits.CNF7 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.bits.CNF7 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.bits.CNF7 = 0b10;
			GPIOx->BSRR.bits.BS7 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.bits.CNF7 = 0b10;
			GPIOx->BRR.bits.BR7  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRL.bits.CNF7 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRL.bits.CNF7 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRL.bits.CNF7 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRL.bits.CNF7 = 0b11;
			break;
		}
		break;
	case GPIO_PIN8:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRH.bits.MODE8 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRH.bits.MODE8 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRH.bits.MODE8 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRH.bits.MODE8 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRH.bits.CNF8 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRH.bits.CNF8 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRH.bits.CNF8 = 0b10;
			GPIOx->BSRR.bits.BS8 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRH.bits.CNF8 = 0b10;
			GPIOx->BRR.bits.BR8  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRH.bits.CNF8 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRH.bits.CNF8 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRH.bits.CNF8 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRH.bits.CNF8 = 0b11;
			break;
		}
		break;
	case GPIO_PIN9:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRH.bits.MODE9 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRH.bits.MODE9 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRH.bits.MODE9 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRH.bits.MODE9 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRH.bits.CNF9 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRH.bits.CNF9 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRH.bits.CNF9 = 0b10;
			GPIOx->BSRR.bits.BS9 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRH.bits.CNF9 = 0b10;
			GPIOx->BRR.bits.BR9 = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRH.bits.CNF9 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRH.bits.CNF9 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRH.bits.CNF9 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRH.bits.CNF9 = 0b11;
			break;
		}
		break;
	case GPIO_PIN10:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRH.bits.MODE10 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRH.bits.MODE10 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRH.bits.MODE10 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRH.bits.MODE10 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRH.bits.CNF10 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRH.bits.CNF10 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRH.bits.CNF10 = 0b10;
			GPIOx->BSRR.bits.BS10 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRH.bits.CNF10 = 0b10;
			GPIOx->BRR.bits.BR10 = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRH.bits.CNF10 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRH.bits.CNF10 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRH.bits.CNF10 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRH.bits.CNF10 = 0b11;
			break;
		}
		break;

		case GPIO_PIN11:
			if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
				GPIOx->CRH.bits.MODE11 = 0b01;
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
				GPIOx->CRH.bits.MODE11 = 0b010;
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
				GPIOx->CRH.bits.MODE11 = 0b11;
			if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
				GPIOx->CRH.bits.MODE11 = 0b00;

