darshme7/embedded_systems_online_diploma/Unit7_MCUEssentialPeripherals/Assignment3/stm32f103c8_gpio_driver.c
			switch(cfg->GPIO_PinMode){
			case GPIO_MODE_ANALOG:
				GPIOx->CRH.bits.CNF11 = 0b00;
				break;
			case GPIO_MODE_INPUT_FLO:
				GPIOx->CRH.bits.CNF11 = 0b01;
				break;
			case GPIO_MODE_INPUT_PU:
				GPIOx->CRH.bits.CNF11 = 0b10;
				GPIOx->BSRR.bits.BS11 = 0b1;
				break;
			case GPIO_MODE_INPUT_PD:
				GPIOx->CRH.bits.CNF11 = 0b10;
				GPIOx->BRR.bits.BR11  = 0b1;
				break;
			case GPIO_MODE_OUTPUT_PP:
				GPIOx->CRH.bits.CNF11 = 0b00;
				break;
			case GPIO_MODE_OUTPUT_OD:
				GPIOx->CRH.bits.CNF11 = 0b01;
				break;
			case GPIO_MODE_OUTPUT_AF_PP:
				GPIOx->CRH.bits.CNF11 = 0b10;
				break;
			case GPIO_MODE_OUTPUT_AF_OD:
				GPIOx->CRH.bits.CNF11 = 0b11;
				break;
			}
			break;
	case GPIO_PIN12:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRH.bits.MODE12 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRH.bits.MODE12 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRH.bits.MODE12 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRH.bits.MODE12 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRH.bits.CNF12 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRH.bits.CNF12 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRH.bits.CNF12 = 0b10;
			GPIOx->BSRR.bits.BS12 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRH.bits.CNF12 = 0b10;
			GPIOx->BRR.bits.BR12  = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRH.bits.CNF12 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRH.bits.CNF12 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRH.bits.CNF12 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRH.bits.CNF12 = 0b11;
			break;
		}
		break;
		case GPIO_PIN13:
			if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
				GPIOx->CRH.bits.MODE13 = 0b01;
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
				GPIOx->CRH.bits.MODE13 = 0b010;
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
				GPIOx->CRH.bits.MODE13 = 0b11;
			if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
				GPIOx->CRH.bits.MODE13 = 0b00;

			switch(cfg->GPIO_PinMode){
			case GPIO_MODE_ANALOG:
				GPIOx->CRH.bits.CNF13 = 0b00;
				break;
			case GPIO_MODE_INPUT_FLO:
				GPIOx->CRH.bits.CNF13 = 0b01;
				break;
			case GPIO_MODE_INPUT_PU:
				GPIOx->CRH.bits.CNF13 = 0b10;
				GPIOx->BSRR.bits.BS13 = 0b1;
				break;
			case GPIO_MODE_INPUT_PD:
				GPIOx->CRH.bits.CNF13 = 0b10;
				GPIOx->BRR.bits.BR13 = 0b1;
				break;
			case GPIO_MODE_OUTPUT_PP:
				GPIOx->CRH.bits.CNF13 = 0b00;
				break;
			case GPIO_MODE_OUTPUT_OD:
				GPIOx->CRH.bits.CNF13 = 0b01;
				break;
			case GPIO_MODE_OUTPUT_AF_PP:
				GPIOx->CRH.bits.CNF13 = 0b10;
				break;
			case GPIO_MODE_OUTPUT_AF_OD:
				GPIOx->CRH.bits.CNF13 = 0b11;
				break;
			}
			break;

	case GPIO_PIN14:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRH.bits.MODE14 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRH.bits.MODE14 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRH.bits.MODE14 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRH.bits.MODE14 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRH.bits.CNF14 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRH.bits.CNF14 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRH.bits.CNF14 = 0b10;
			GPIOx->BSRR.bits.BS14 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRH.bits.CNF14 = 0b10;
			GPIOx->BRR.bits.BR14 = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRH.bits.CNF14 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRH.bits.CNF14 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRH.bits.CNF14 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRH.bits.CNF14 = 0b11;
			break;
		}
		break;

	case GPIO_PIN15:
		if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M)
			GPIOx->CRH.bits.MODE15 = 0b01;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M)
			GPIOx->CRH.bits.MODE15 = 0b010;
		else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M)
			GPIOx->CRH.bits.MODE15 = 0b11;
		if(cfg->GPIO_PinMode ==GPIO_MODE_ANALOG||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_FLO||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PU||cfg->GPIO_PinMode ==GPIO_MODE_INPUT_PD)
			GPIOx->CRH.bits.MODE15 = 0b00;

		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRH.bits.CNF15 = 0b00;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRH.bits.CNF15 = 0b01;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRH.bits.CNF15 = 0b10;
			GPIOx->BSRR.bits.BS15 = 0b1;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRH.bits.CNF15 = 0b10;
			GPIOx->BRR.bits.BR15 = 0b1;
			break;
		case GPIO_MODE_OUTPUT_PP:
			GPIOx->CRH.bits.CNF15 = 0b00;
			break;
		case GPIO_MODE_OUTPUT_OD:
			GPIOx->CRH.bits.CNF15 = 0b01;
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			GPIOx->CRH.bits.CNF15 = 0b10;
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			GPIOx->CRH.bits.CNF15 = 0b11;
			break;
		}
		break;

	case GPIO_PORT:
		switch(cfg->GPIO_PinMode){
		case GPIO_MODE_ANALOG:
			GPIOx->CRL.CRL = 0x00000000;
			GPIOx->CRH.CRH = 0x00000000;
			break;
		case GPIO_MODE_INPUT_FLO:
			GPIOx->CRL.CRL = 0x44444444;
			GPIOx->CRH.CRH = 0x44444444;
			break;
		case GPIO_MODE_INPUT_PU:
			GPIOx->CRL.CRL  = 0x88888888;
			GPIOx->CRH.CRH = 0x88888888;
			GPIOx->BSRR.BSRR = 0x0000FFFF;
			break;
		case GPIO_MODE_INPUT_PD:
			GPIOx->CRL.CRL = 0x88888888;
			GPIOx->CRH.CRH = 0x88888888;
			GPIOx->BRR.BRR = 0x0000FFFF;
			break;
		case GPIO_MODE_OUTPUT_PP:
			if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M){
				GPIOx->CRL.CRL = 0x11111111;
				GPIOx->CRH.CRH = 0x11111111;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M){
				GPIOx->CRH.CRH = 0x22222222;
				GPIOx->CRL.CRL = 0x22222222;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M){
				GPIOx->CRH.CRH= 0x33333333;
				GPIOx->CRL.CRL = 0x33333333;
			}
			break;
		case GPIO_MODE_OUTPUT_OD:
			if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M){
				GPIOx->CRL.CRL = 0x55555555;
				GPIOx->CRH.CRH = 0x55555555;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M){
				GPIOx->CRH.CRH = 0x66666666;
				GPIOx->CRL.CRL = 0x66666666;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M){
				GPIOx->CRH.CRH = 0x77777777;
				GPIOx->CRL.CRL = 0x77777777;
			}
			break;
		case GPIO_MODE_OUTPUT_AF_PP:
			if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M){
				GPIOx->CRL.CRL = 0x99999999;
				GPIOx->CRH.CRH = 0x99999999;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M){
				GPIOx->CRH.CRH = 0xAAAAAAAA;
				GPIOx->CRL.CRL = 0xAAAAAAAA;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M){
				GPIOx->CRH.CRH = 0xBBBBBBBB;
				GPIOx->CRL.CRL = 0xBBBBBBBB;
			}
			break;
		case GPIO_MODE_OUTPUT_AF_OD:
			if(cfg->GPIO_OutputSpeed == GPIO_SPEED_10M){
				GPIOx->CRL.CRL = 0xDDDDDDDD;
				GPIOx->CRH.CRH = 0xDDDDDDDD;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_2M){
				GPIOx->CRH.CRH = 0xEEEEEEEE;
				GPIOx->CRL.CRL = 0xEEEEEEEE;
			}
			else if(cfg->GPIO_OutputSpeed == GPIO_SPEED_50M){
				GPIOx->CRH.CRH = 0xFFFFFFFF;
				GPIOx->CRL.CRL = 0xFFFFFFFF;
			}
			break;
		}
		break;
	}
}


