darshme7/embedded_systems_online_diploma/Unit7_MCUEssentialPeripherals/Assignment3/stm32f103c8_gpio_driver.c
/**================================================================
 * @Fn			-MCAL_GPIO_deinit.
 * @brief	    -Reset the GPIOx registers.
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @retval 		-none
 * Note			-none
 */
void MCAL_GPIO_deinit(GPIO_typedef * GPIOx){

	if(GPIOx == GPIOA){
		RCC->APB2RSTR.bits.IOPARST = 0b1;
		RCC->APB2RSTR.bits.IOPARST = 0b0;
	}
	else if(GPIOx == GPIOB){
		RCC->APB2RSTR.bits.IOPBRST = 0b1;
		RCC->APB2RSTR.bits.IOPBRST = 0b0;
	}
	else if(GPIOx == GPIOC){
		RCC->APB2RSTR.bits.IOPCRST = 0b1;
		RCC->APB2RSTR.bits.IOPCRST = 0b0;
	}
	else if(GPIOx == GPIOD){
		RCC->APB2RSTR.bits.IOPDRST = 0b1;
		RCC->APB2RSTR.bits.IOPDRST = 0b0;
	}
	else if(GPIOx == GPIOE){
		RCC->APB2RSTR.bits.IOPERST = 0b1;
		RCC->APB2RSTR.bits.IOPERST = 0b0;
	}


}

/**================================================================
 * @Fn			-MCAL_GPIO_readPin.
 * @brief	    -Reads the GPIOx PINy input value.
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @param [in] 	-PinNumber: Specifies the PIN to be read.
 * @retval 		-either one of two states check: @ref GPIO_PIN_STATE_define
 * Note			-none
 */
uint8 MCAL_GPIO_readPin(GPIO_typedef * GPIOx,uint8 PinNumber ){

	uint8 state;
	switch(PinNumber){
	case GPIO_PIN0:
		state =(uint8)GPIOx->IDR.bits.IDR0;
		return state ;
	case GPIO_PIN1:
		state =(uint8)GPIOx->IDR.bits.IDR1;
		return state ;
	case GPIO_PIN2:
		state =(uint8)GPIOx->IDR.bits.IDR2;
		return state ;
	case GPIO_PIN3:
		state =(uint8)GPIOx->IDR.bits.IDR3;
		return state ;
	case GPIO_PIN4:
		state =(uint8)GPIOx->IDR.bits.IDR4;
		return state ;
	case GPIO_PIN5:
		state =(uint8)GPIOx->IDR.bits.IDR5;
		return state ;
	case GPIO_PIN6:
		state =(uint8)GPIOx->IDR.bits.IDR6;
		return state ;
	case GPIO_PIN7:
		state =(uint8)GPIOx->IDR.bits.IDR7;
		return state ;
	case GPIO_PIN8:
		state =(uint8)GPIOx->IDR.bits.IDR8;
		return state ;
	case GPIO_PIN9:
		state =(uint8)GPIOx->IDR.bits.IDR9;
		return state ;
	case GPIO_PIN10:
		state =(uint8)GPIOx->IDR.bits.IDR10;
		return state ;
	case GPIO_PIN11:
		state =(uint8)GPIOx->IDR.bits.IDR11;
		return state ;
	case GPIO_PIN12:
		state =(uint8)GPIOx->IDR.bits.IDR12;
		return state ;
	case GPIO_PIN13:
		state =(uint8)GPIOx->IDR.bits.IDR13;
		return state ;
	case GPIO_PIN14:
		state =(uint8)GPIOx->IDR.bits.IDR14;
		return state ;
	case GPIO_PIN15:
		state =(uint8)GPIOx->IDR.bits.IDR15;
		return state ;
	}
	return 0;
}
/**================================================================
 * @Fn			-MCAL_GPIO_readPort.
 * @brief	    -Reads the GPIOx input value.
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @retval 		-the input value on GPIOx
 * Note			-none
 */
uint16 MCAL_GPIO_readPort(GPIO_typedef * GPIOx){

	uint16 value = (uint16)GPIOx->IDR.IDR;
	return value;
}
/**================================================================
 * @Fn			-MCAL_GPIO_writePin.
 * @brief	    -writes either one of @ref GPIO_PIN_STATE_define value on the GPIOx PINy.
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @param [in] 	-PinNumber: Specifies the PIN to be read.
 * @param [in]  -data: Specifies one of @ref GPIO_PIN_STATE_define to be written.
 * @retval 		-none
 * Note			-none
 */
void MCAL_GPIO_writePin(GPIO_typedef * GPIOx,uint8 PinNumber,uint8 data ){

	switch(PinNumber){
	case GPIO_PIN0:
		if(data)
			GPIOx->BSRR.bits.BS0 = 0b1 ;
		else
			GPIOx->BRR.bits.BR0 = 0b1 ;
		break;
	case GPIO_PIN1:
		if(data)
			GPIOx->BSRR.bits.BS1 = 0b1 ;
		else
			GPIOx->BRR.bits.BR1 = 0b1 ;
		break;
	case GPIO_PIN2:
		if(data)
			GPIOx->BSRR.bits.BS2 = 0b1 ;
		else
			GPIOx->BRR.bits.BR2= 0b1 ;
		break;
	case GPIO_PIN3:
		if(data)
			GPIOx->BSRR.bits.BS3 = 0b1 ;
		else
			GPIOx->BRR.bits.BR3 = 0b1 ;
		break;
	case GPIO_PIN4:
		if(data)
			GPIOx->BSRR.bits.BS4 = 0b1 ;
		else
			GPIOx->BRR.bits.BR4 = 0b1 ;
		break;
	case GPIO_PIN5:
		if(data)
			GPIOx->BSRR.bits.BS5 = 0b1 ;
		else
			GPIOx->BRR.bits.BR5 = 0b1 ;
		break;
	case GPIO_PIN6:
		if(data)
			GPIOx->BSRR.bits.BS6 = 0b1 ;
		else
			GPIOx->BRR.bits.BR6 = 0b1 ;
		break;
	case GPIO_PIN7:
		if(data)
			GPIOx->BSRR.bits.BS7 = 0b1 ;
		else
			GPIOx->BRR.bits.BR7 = 0b1 ;
		break;
	case GPIO_PIN8:
		if(data)
			GPIOx->BSRR.bits.BS8 = 0b1 ;
		else
			GPIOx->BRR.bits.BR8 = 0b1 ;
		break;
	case GPIO_PIN9:
		if(data)
			GPIOx->BSRR.bits.BS9 = 0b1 ;
		else
			GPIOx->BRR.bits.BR9 = 0b1 ;
		break;
	case GPIO_PIN10:
		if(data)
			GPIOx->BSRR.bits.BS10 = 0b1 ;
		else
			GPIOx->BRR.bits.BR10 = 0b1 ;
		break;
	case GPIO_PIN11:
		if(data)
			GPIOx->BSRR.bits.BS11 = 0b1 ;
		else
			GPIOx->BRR.bits.BR11 = 0b1 ;
		break;
	case GPIO_PIN12:
		if(data)
			GPIOx->BSRR.bits.BS12 = 0b1 ;
		else
			GPIOx->BRR.bits.BR12 = 0b1 ;
		break;
	case GPIO_PIN13:
		if(data)
			GPIOx->BSRR.bits.BS13 = 0b1 ;
		else
			GPIOx->BRR.bits.BR13 = 0b1 ;
		break;
	case GPIO_PIN14:
		if(data)
			GPIOx->BSRR.bits.BR14 = 0b1 ;
		else
			GPIOx->BRR.bits.BR14 = 0b1 ;
		break;
	case GPIO_PIN15:
		if(data)
			GPIOx->BSRR.bits.BS15 = 0b1 ;
		else
			GPIOx->BRR.bits.BR15 = 0b1 ;
		break;
	}
}
/**================================================================
 * @Fn			-MCAL_GPIO_writePort.
 * @brief	    -writes data on the GPIOx.
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @param [in] 	-data: Specifies the data to be written.
 * @retval 		-none
 * Note			-none
 */
void MCAL_GPIO_writePort(GPIO_typedef * GPIOx,uint16 data ){

	GPIOx->ODR.ODR = (uint32) data;
}
/**================================================================
 * @Fn			-MCAL_GPIO_togglePin.
 * @brief	    -toggle the GPIOx PINy .
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @param [in] 	-PinNumber: Specifies the PIN to be toggled.
 * @retval 		-none
 * Note			-none
 */
void MCAL_GPIO_togglePin(GPIO_typedef * GPIOx,uint8 PinNumber){
	switch(PinNumber){
	case GPIO_PIN0:
		GPIOx->ODR.bits.ODR0 ^= 0b1 ;
		break;
	case GPIO_PIN1:
		GPIOx->ODR.bits.ODR1 ^= 0b1 ;
		break;
	case GPIO_PIN2:
		GPIOx->ODR.bits.ODR2 ^= 0b1 ;
		break;
	case GPIO_PIN3:
		GPIOx->ODR.bits.ODR3 ^= 0b1 ;
		break;
	case GPIO_PIN4:
		GPIOx->ODR.bits.ODR4 ^= 0b1 ;
		break;
	case GPIO_PIN5:
		GPIOx->ODR.bits.ODR5 ^= 0b1 ;
		break;
	case GPIO_PIN6:
		GPIOx->ODR.bits.ODR6 ^= 0b1 ;
		break;
	case GPIO_PIN7:
		GPIOx->ODR.bits.ODR7 ^= 0b1 ;
		break;
	case GPIO_PIN8:
		GPIOx->ODR.bits.ODR8 ^= 0b1 ;
		break;
	case GPIO_PIN9:
		GPIOx->ODR.bits.ODR9 ^= 0b1 ;
		break;
	case GPIO_PIN10:
		GPIOx->ODR.bits.ODR10 ^= 0b1 ;
		break;
	case GPIO_PIN11:
		GPIOx->ODR.bits.ODR11 ^= 0b1 ;
		break;
	case GPIO_PIN12:
		GPIOx->ODR.bits.ODR12 ^= 0b1 ;
		break;
	case GPIO_PIN13:
		GPIOx->ODR.bits.ODR13 ^= 0b1 ;
		break;
	case GPIO_PIN14:
		GPIOx->ODR.bits.ODR14 ^= 0b1 ;
		break;
	case GPIO_PIN15:
		GPIOx->ODR.bits.ODR15 ^= 0b1 ;
		break;
	}
}
/**================================================================
 * @Fn			-MCAL_GPIO_lockPin.
 * @brief	    -Lock the GPIOx PINy.
 * @param [in] 	-GPIOx: x can be (A...E) to select the GPIO peripheral.
 * @param [in] 	-PinNumber: Specifies the PIN to be locked.
 * @retval 		-returns one of @ref GPIO_LOCK_STATE_define
 * Note			-none
 */
uint8 MCAL_GPIO_lockPin(GPIO_typedef * GPIOx,uint8 PinNumber){

