darshme7/embedded_systems_online_diploma/Unit7_MCUEssentialPeripherals/Assignment3/stm32f103c8_gpio_driver.c
	//LCKK: Lock key
	//This bit can be read anytime. It can only be modified using the Lock Key Writing Sequence.
	//0: Port configuration lock key not active
	//1: Port configuration lock key active. GPIOx_LCKR register is locked until the next reset.
	//	LOCK key writing sequence:
	//	Write 1
	//	Write 0
	//	Write 1
	//	Read 0
	//	Read 1 (this read is optional but confirms that the lock is active)
	//		Note: During the LOCK Key Writing sequence, the value of LCK[15:0] must not change.
	//		Any error in the lock sequence will abort the lock

	switch(PinNumber){
	case GPIO_PIN0:
		GPIOx->LCKR.bits.LCK0 = 0b1 ;
		break;
	case GPIO_PIN1:
		GPIOx->LCKR.bits.LCK1 = 0b1 ;
		break;
	case GPIO_PIN2:
		GPIOx->LCKR.bits.LCK2 = 0b1 ;
		break;
	case GPIO_PIN3:
		GPIOx->LCKR.bits.LCK3 = 0b1 ;
		break;
	case GPIO_PIN4:
		GPIOx->LCKR.bits.LCK4 = 0b1 ;
		break;
	case GPIO_PIN5:
		GPIOx->LCKR.bits.LCK5 = 0b1 ;
		break;
	case GPIO_PIN6:
		GPIOx->LCKR.bits.LCK6 = 0b1 ;
		break;
	case GPIO_PIN7:
		GPIOx->LCKR.bits.LCK7 = 0b1 ;
		break;
	case GPIO_PIN8:
		GPIOx->LCKR.bits.LCK8 = 0b1 ;
		break;
	case GPIO_PIN9:
		GPIOx->LCKR.bits.LCK9 = 0b1 ;
		break;
	case GPIO_PIN10:
		GPIOx->LCKR.bits.LCK10 = 0b1 ;
		break;
	case GPIO_PIN11:
		GPIOx->LCKR.bits.LCK11 = 0b1 ;
		break;
	case GPIO_PIN12:
		GPIOx->LCKR.bits.LCK12 = 0b1 ;
		break;
	case GPIO_PIN13:
		GPIOx->LCKR.bits.LCK13 = 0b1 ;
		break;
	case GPIO_PIN14:
		GPIOx->LCKR.bits.LCK14 = 0b1 ;
		break;
	case GPIO_PIN15:
		GPIOx->LCKR.bits.LCK15 = 0b1 ;
		break;
	}
	GPIOx->LCKR.bits.LCKK = 0b1 ;
	GPIOx->LCKR.bits.LCKK = 0b0 ;
	GPIOx->LCKR.bits.LCKK = 0b1 ;
	if(!(GPIOx->LCKR.bits.LCKK)){
		GPIOx->LCKR.bits.LCKK ;
		return GPIO_LOCK_ENABLED;
	}
	else
		return GPIO_LOCK_FAILED;

}
